# Copy Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterValue..::..Copy Method
ParameterValue Class See Also
---
Makes an identical copy of the given parameter value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public ParameterValue Copy()
```

Visual Basic
---
```text
Public Function Copy As ParameterValue
```

Visual C++
---
```text
public:
ParameterValue^ Copy()
```

# See Also
ParameterValue Class
Autodesk.Revit.DB Namespace